# COME√áANDO A TRILHA DE DADOS
COM O BANCO DE DADOS DO RODRIG√ÉO

In [211]:
#importando a biblioteca pandas
import pandas as pd

## 03 Importando um base de dados

In [212]:
#importando o dataframe do rodrigao
dados = pd.read_csv(r"./datasets/venda-de-carros.csv")

In [213]:
# imprimindo os dados do dataframe
print(dados)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [214]:
# M√©todo .head() exibe as 5 primeiras linhas da base de dados por padr√£o, ou quantas linhas eu
# quiser passando o valor dentro do head
dados.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [215]:
# exibindo 8 linhas
dados.head(8)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00

In [216]:
dados.head(10)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

## 04 Informa√ß√µes da base de dados

In [217]:
#4 Informa√ß√µes da base de dados
dados.info()
#M√©todo .info() exibe as informa√ß√µes da base:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

**<class 'pandas.core.frame.DataFrame'>** informa que a base √© um DataFrame (formato de base de
dados no python). </br>
**RangeIndex: 10 entries, 0 to 9: informa que tem 10 linhas, e o index vai de 0 at√© 9.** </br>
Non-Null Count: informa se possui valores nulos em cada coluna. </br>
Dtype: informa o tipo de dado de cada coluna.

## 05 DataFrame

In [218]:
type(dados)

pandas.core.frame.DataFrame

In [219]:
dados.shape
#O atributo .shape retorna quantas linhas e colunas tem no DataFrame:

(10, 5)

In [220]:
# Criando um DataFrame:
# Fun√ß√£o .DataFrame() do pandas cria um DataFrame, podemos passar um dicion√°rio para criar:
pessoasDeUmaEmpresa = pd.DataFrame({
    "nome": ["Lucas Marcelo", "Richard Ribeiro", "Fabio Henrique"],
    "idade": [41 ,19 , 27],
    "peso": [81.5, 65.2, 70]
})

In [221]:
# exibindo o valor de um dataframe criado acima
print(pessoasDeUmaEmpresa)

              nome  idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

In [222]:
# exibindo o valor do dataframe
pessoasDeUmaEmpresa.head(3)

              nome  idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

In [223]:
# exibindo as informa√ß√µes do dataframe
pessoasDeUmaEmpresa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    3 non-null      object
 1   idade   3 non-null      int64
 2   peso    3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

### ‚úèÔ∏è Renomeando Colunas em um DataFrame (`pandas`)

Existem duas formas comuns de renomear colunas em um DataFrame:

---

#### ‚úÖ 1. Usando o m√©todo `.rename()`:

```python
df.rename(columns={"coluna_antiga": "coluna_nova"}, inplace=True)

Atributo **.columns** retorna uma ‚Äúlista‚Äù com nome de todas as colunas, tamb√©m √© poss√≠vel
armazenar em uma lista:

In [224]:
# exibindo uma "lista" com nome de todas as colunas
pessoasDeUmaEmpresa.columns

Index(['nome', 'idade', 'peso'], dtype='object')

In [225]:
# armazenando as colunas em uma lista
# pessoasDeUmaEmpresa = list(pessoasDeUmaEmpresa.columns)
# print(pessoasDeUmaEmpresa)

O m√©todo **.rename()** serve para renomear as colunas passando um dicion√°rio, no exemplo abaixo </br>
estamos criando um novo DataFrame com as colunas renomeadas:

In [226]:
pessoasDeUmaEmpresaRenomeando = pessoasDeUmaEmpresa.rename(columns = {
    "nome": "Nome Completo", # renomeia a coluna de nome "nome" para "Nome Completo"
    "idade": "Idade" # renomeia a coluna de nome "idade" para "Idade"
})

print(pessoasDeUmaEmpresaRenomeando)

     Nome Completo  Idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

√â poss√≠vel tamb√©m renomear o DataFrame original, nesse caso pessoasDeUmaEmpresa, e continuar </br>
utilizando-o, basta colocar **inplace = True**, veja o exemplo:

In [227]:
pessoasDeUmaEmpresa.rename(columns = {
    "nome": "Nome Completo", # renomeia a coluna de nome "nome" para "Nome Completo"
    "idade": "Idade", # renomeia a coluna de nome "idade" para "Idade"
},
    inplace=True
)

print(pessoasDeUmaEmpresa)

     Nome Completo  Idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

Outra forma de renomear √© utilizando **.columns** e passando uma lista com os novos nomes:

In [228]:
pessoasDeUmaEmpresa.columns = ["NOME", "IDADE", "PESO"]

print(pessoasDeUmaEmpresa)

              NOME  IDADE  PESO
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

### 06 Series

### üìä Resumo sobre `pandas.Series` (Python)

- Uma `Series` √© uma estrutura **unidimensional** do `pandas`, parecida com uma **coluna de uma planilha**.
- Armazena **valores** com **√≠ndices** associados (autom√°ticos ou personalizados).
- Cada coluna de um `DataFrame` √©, na verdade, uma `Series`.

#### ‚úÖ Como criar uma `Series`:
```python
import pandas as pd

# Com lista
serie = pd.Series([10, 20, 30])

# Com √≠ndice personalizado
serie = pd.Series([10, 20, 30], index=['a', 'b', 'c'])

In [229]:
# exibi apenas os valores da coluna "Fabricante"
print(dados["Fabricante"])

print("\n")
# mostra o tipo da coluna "Fabricante", resulta em object("string")
type(dados["Fabricante"])

# mostra apenas os valores(sem os indices), Retorna um Array tipo NumPy
print("Exibindo apenas os valores")
print(dados["Fabricante"].values)

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Fabricante, dtype: object


Exibindo apenas os valores
['Toyota' 'Honda' 'Toyota' 'BMW' 'Nissan' 'Toyota' 'Honda' 'Honda'
 'Toyota' 'Nissan']

Criando uma Series: </br>
O m√©todo **.Series()** cria uma series, basta passar uma lista, ex:

In [230]:
series1 = pd.Series([5.5, 6.0, 9.5])
print(series1)

0    5.5
1    6.0
2    9.5
dtype: float64

Tamb√©m √© poss√≠vel modificar o index e o nome:

In [231]:
series1 = pd.Series([5.5, 6.0, 9.5], index=["prova 1", "prova 2", "projeto"], name = "Notas dos alunos")
print(series1)

prova 1    5.5
prova 2    6.0
projeto    9.5
Name: Notas dos alunos, dtype: float64

Para criar uma c√≥pia, precisamos utilizar o **.copy()**

In [232]:
cor_copia = dados["Cor"].copy
print(cor_copia)

<bound method NDFrame.copy of 0      Branco
1    Vermelho
2        Azul
3       Preto
4      Branco
5       Verde
6        Azul
7        Azul
8      Branco
9      Branco
Name: Cor, dtype: object>

Para gerar DataFrame a partir de series, podemos usar o **.concat():**

In [233]:
series1 = pd.Series([5.5, 6.0, 9.5], index=["prova 1", "prova 2", "projeto"], name = "Notas dos alunos")
series2 = pd.Series([4.5, 7.0, 2.5], index=["prova 1", "prova 2", "projeto"], name = "Notas dos alunos2")

dados_series = pd.concat([series1, series2], axis=1)
print(dados_series)

         Notas dos alunos  Notas dos alunos2
prova 1               5.5                4.5
prova 2               6.0                7.0
projeto               9.5                2.5

# üß© Aula #08 - Criando Colunas em Python (Pandas)

Nesta aula aprendemos como adicionar novas colunas em um DataFrame usando `pandas`, algo essencial para enriquecer e transformar nossos dados üìä.

---

## ‚úçÔ∏è Formas de criar colunas:

üîπ **Atribui√ß√£o direta**  
```python
df['nova_coluna'] = [1, 2, 3]
df['fixo'] = 0

Podemos criar uma nova coluna a nossa base passando o nome dela, e o que queremos para
ela, ex:

In [234]:
#dados["Nova coluna"] = "Testando"
#print(dados)

Podemos criar tamb√©m utilizando outra coluna, como por exemplo, criar uma coluna multiplicando </br>
a Quilometragem por 2:

In [235]:
dados["Quilometragem2"] = dados["Quilometragem"] * 2
print(dados)

  Fabricante       Cor  Quilometragem  Portas          Preco  Quilometragem2
0     Toyota    Branco         150043       4   R$ 24,000.00          300086
1      Honda  Vermelho          87899       4   R$ 25,000.00          175798
2     Toyota      Azul          32549       3   R$ 27,000.00           65098
3        BMW     Preto          11179       5  R$ 122,000.00           22358
4     Nissan    Branco         213095       4   R$ 13,500.00          426190
5     Toyota     Verde          99213       4   R$ 14,500.00          198426
6      Honda      Azul          45698       4   R$ 17,500.00           91396
7      Honda      Azul          54738       4   R$ 27,000.00          109476
8     Toyota    Branco          60000       4   R$ 26,250.00          120000
9     Nissan    Branco          31600       4   R$ 19,700.00           63200

# üî¢ Aula #10 - Sele√ß√£o por √çndices em Python (Pandas)

Nesta aula aprendemos como selecionar dados em um DataFrame usando **√≠ndices**. Isso √© super √∫til para acessar linhas e colunas espec√≠ficas de forma r√°pida e eficiente!

---

## üß≠ Tipos de sele√ß√£o por √≠ndice:

### üîπ `loc[]` ‚Üí Sele√ß√£o por **r√≥tulo** (nome das linhas/colunas)
Usado quando queremos acessar dados pelo nome da linha ou coluna:
```python
df.loc[0]  # Acessa a linha com √≠ndice 0
df.loc[0, 'nome']  # Acessa o valor da coluna 'nome' na linha 0

O **.iloc[]** retorna todas as observa√ß√µes indexadas na posi√ß√£o (posi√ß√£o come√ßa do 0) que
escolher, ex:

In [236]:
print(dados)
dados.iloc[1]

  Fabricante       Cor  Quilometragem  Portas          Preco  Quilometragem2
0     Toyota    Branco         150043       4   R$ 24,000.00          300086
1      Honda  Vermelho          87899       4   R$ 25,000.00          175798
2     Toyota      Azul          32549       3   R$ 27,000.00           65098
3        BMW     Preto          11179       5  R$ 122,000.00           22358
4     Nissan    Branco         213095       4   R$ 13,500.00          426190
5     Toyota     Verde          99213       4   R$ 14,500.00          198426
6      Honda      Azul          45698       4   R$ 17,500.00           91396
7      Honda      Azul          54738       4   R$ 27,000.00          109476
8     Toyota    Branco          60000       4   R$ 26,250.00          120000
9     Nissan    Branco          31600       4   R$ 19,700.00           63200

Fabricante               Honda
Cor                   Vermelho
Quilometragem            87899
Portas                       4
Preco             R$ 25,000.00
Quilometragem2          175798
Name: 1, dtype: object

Tamb√©m √© poss√≠vel acessar linhas e colunas, colocando uma v√≠rgula:

In [237]:
print(dados)
dados.iloc[4:6, 2]

  Fabricante       Cor  Quilometragem  Portas          Preco  Quilometragem2
0     Toyota    Branco         150043       4   R$ 24,000.00          300086
1      Honda  Vermelho          87899       4   R$ 25,000.00          175798
2     Toyota      Azul          32549       3   R$ 27,000.00           65098
3        BMW     Preto          11179       5  R$ 122,000.00           22358
4     Nissan    Branco         213095       4   R$ 13,500.00          426190
5     Toyota     Verde          99213       4   R$ 14,500.00          198426
6      Honda      Azul          45698       4   R$ 17,500.00           91396
7      Honda      Azul          54738       4   R$ 27,000.00          109476
8     Toyota    Branco          60000       4   R$ 26,250.00          120000
9     Nissan    Branco          31600       4   R$ 19,700.00           63200

4    213095
5     99213
Name: Quilometragem, dtype: int64

O **.loc[]** faz o index acessa os r√≥tulos dos index, se eu acessar o r√≥tulo 4 do index:

In [238]:
print(dados)
dados.loc[4]

  Fabricante       Cor  Quilometragem  Portas          Preco  Quilometragem2
0     Toyota    Branco         150043       4   R$ 24,000.00          300086
1      Honda  Vermelho          87899       4   R$ 25,000.00          175798
2     Toyota      Azul          32549       3   R$ 27,000.00           65098
3        BMW     Preto          11179       5  R$ 122,000.00           22358
4     Nissan    Branco         213095       4   R$ 13,500.00          426190
5     Toyota     Verde          99213       4   R$ 14,500.00          198426
6      Honda      Azul          45698       4   R$ 17,500.00           91396
7      Honda      Azul          54738       4   R$ 27,000.00          109476
8     Toyota    Branco          60000       4   R$ 26,250.00          120000
9     Nissan    Branco          31600       4   R$ 19,700.00           63200

Fabricante              Nissan
Cor                     Branco
Quilometragem           213095
Portas                       4
Preco             R$ 13,500.00
Quilometragem2          426190
Name: 4, dtype: object

In [239]:
print(dados)
dados.loc[4:6]

  Fabricante       Cor  Quilometragem  Portas          Preco  Quilometragem2
0     Toyota    Branco         150043       4   R$ 24,000.00          300086
1      Honda  Vermelho          87899       4   R$ 25,000.00          175798
2     Toyota      Azul          32549       3   R$ 27,000.00           65098
3        BMW     Preto          11179       5  R$ 122,000.00           22358
4     Nissan    Branco         213095       4   R$ 13,500.00          426190
5     Toyota     Verde          99213       4   R$ 14,500.00          198426
6      Honda      Azul          45698       4   R$ 17,500.00           91396
7      Honda      Azul          54738       4   R$ 27,000.00          109476
8     Toyota    Branco          60000       4   R$ 26,250.00          120000
9     Nissan    Branco          31600       4   R$ 19,700.00           63200

  Fabricante     Cor  Quilometragem  Portas         Preco  Quilometragem2
4     Nissan  Branco         213095       4  R$ 13,500.00          426190
5     Toyota   Verde          99213       4  R$ 14,500.00          198426
6      Honda    Azul          45698       4  R$ 17,500.00           91396

Tamb√©m √© poss√≠vel acessar linhas e colunas, colocando uma v√≠rgula:

In [240]:
print(dados)
dados.loc[4:6, "Quilometragem"]

  Fabricante       Cor  Quilometragem  Portas          Preco  Quilometragem2
0     Toyota    Branco         150043       4   R$ 24,000.00          300086
1      Honda  Vermelho          87899       4   R$ 25,000.00          175798
2     Toyota      Azul          32549       3   R$ 27,000.00           65098
3        BMW     Preto          11179       5  R$ 122,000.00           22358
4     Nissan    Branco         213095       4   R$ 13,500.00          426190
5     Toyota     Verde          99213       4   R$ 14,500.00          198426
6      Honda      Azul          45698       4   R$ 17,500.00           91396
7      Honda      Azul          54738       4   R$ 27,000.00          109476
8     Toyota    Branco          60000       4   R$ 26,250.00          120000
9     Nissan    Branco          31600       4   R$ 19,700.00           63200

4    213095
5     99213
6     45698
Name: Quilometragem, dtype: int64

Sele√ß√£o de m√∫ltiplas colunas:

In [241]:
dados[["Fabricante", "Cor", "Portas"]]

  Fabricante       Cor  Portas
0     Toyota    Branco       4
1      Honda  Vermelho       4
2     Toyota      Azul       3
3        BMW     Preto       5
4     Nissan    Branco       4
5     Toyota     Verde       4
6      Honda      Azul       4
7      Honda      Azul       4
8     Toyota    Branco       4
9     Nissan    Branco       4

Para deletar uma coluna use o **del**, veja o ex:

In [242]:
print(dados)
del dados["Quilometragem2"]
print("\n")
print(dados)

  Fabricante       Cor  Quilometragem  Portas          Preco  Quilometragem2
0     Toyota    Branco         150043       4   R$ 24,000.00          300086
1      Honda  Vermelho          87899       4   R$ 25,000.00          175798
2     Toyota      Azul          32549       3   R$ 27,000.00           65098
3        BMW     Preto          11179       5  R$ 122,000.00           22358
4     Nissan    Branco         213095       4   R$ 13,500.00          426190
5     Toyota     Verde          99213       4   R$ 14,500.00          198426
6      Honda      Azul          45698       4   R$ 17,500.00           91396
7      Honda      Azul          54738       4   R$ 27,000.00          109476
8     Toyota    Branco          60000       4   R$ 26,250.00          120000
9     Nissan    Branco          31600       4   R$ 19,700.00           63200


  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

# üßπ Aulas #14, #15, #16, #17 ‚Äì Filtragem de Dados em Python (Pandas)

Nessas aulas aprendemos como **filtrar dados** de um DataFrame, ou seja, **selecionar linhas espec√≠ficas** com base em condi√ß√µes l√≥gicas üïµÔ∏è‚Äç‚ôÄÔ∏è.

---

## üîç Filtrando com condi√ß√µes simples

```python
df[df['idade'] > 18]  # Filtra somente maiores de 18
df[df['sexo'] == 'F']  # Filtra somente onde o sexo √© feminino

O **.unique()** retorna os dados √∫nicos de uma coluna:

In [243]:
dados["Fabricante"].unique()

array(['Toyota', 'Honda', 'BMW', 'Nissan'], dtype=object)

Para filtrar por condi√ß√µes, utilizamos **.query()** e no final do filtro usamos **.reset_index()**</br> para os
dados filtrados voltarem o index come√ßando do 0.

In [244]:
dados_filtrados = dados.query("Fabricante == 'Honda' ").reset_index()
print(dados_filtrados)

   index Fabricante       Cor  Quilometragem  Portas         Preco
0      1      Honda  Vermelho          87899       4  R$ 25,000.00
1      6      Honda      Azul          45698       4  R$ 17,500.00
2      7      Honda      Azul          54738       4  R$ 27,000.00

In [245]:
dados_filtrados2 = dados.query("Fabricante == 'Honda' and Cor == 'Azul' ").reset_index()
print(dados_filtrados2)

   index Fabricante   Cor  Quilometragem  Portas         Preco
0      6      Honda  Azul          45698       4  R$ 17,500.00
1      7      Honda  Azul          54738       4  R$ 27,000.00

Outra forma de filtrar

In [246]:
dados_filtrados3 = dados[dados["Fabricante"] == "Honda"]
print(dados_filtrados3)

  Fabricante       Cor  Quilometragem  Portas         Preco
1      Honda  Vermelho          87899       4  R$ 25,000.00
6      Honda      Azul          45698       4  R$ 17,500.00
7      Honda      Azul          54738       4  R$ 27,000.00

In [247]:
dados_filtrados4 = dados[(dados["Fabricante"] == "Honda") & (dados["Cor"] == "Azul")]
print(dados_filtrados4)

  Fabricante   Cor  Quilometragem  Portas         Preco
6      Honda  Azul          45698       4  R$ 17,500.00
7      Honda  Azul          54738       4  R$ 27,000.00

Filtrando a partir de uma lista:

In [248]:
lista_cor = ["Azul", "Vermelho"]
dados_filtrados5 = dados.query("Cor in @lista_cor")
print(dados_filtrados5)

  Fabricante       Cor  Quilometragem  Portas         Preco
1      Honda  Vermelho          87899       4  R$ 25,000.00
2     Toyota      Azul          32549       3  R$ 27,000.00
6      Honda      Azul          45698       4  R$ 17,500.00
7      Honda      Azul          54738       4  R$ 27,000.00

O **.dropna()** remove todas as linhas do DataFrame que s√£o vazias. </br>
O **.fillna()** preenche todos valores vazios de um DataFrame com 0.

# üìä Aula #21 ‚Äì Estat√≠stica Descritiva com Pandas

Nesta aula aprendemos como usar o `pandas` para aplicar **estat√≠sticas descritivas** ‚Äî ou seja, resumir os dados com medidas importantes como m√©dia, mediana, desvio padr√£o e muito mais! üß†üìà

---

## üì¶ M√©todos principais do Pandas:

### üîπ `df.describe()`
Resumo r√°pido com:
- M√©dia (`mean`)
- Desvio padr√£o (`std`)
- M√≠nimo e m√°ximo
- Quartis (25%, 50%, 75%)
```python
df.describe()

O **.describle()** nos retorna a estat√≠stica descritiva como contagem, m√©dia, etc.:

In [249]:
dados["Quilometragem"].describe()

count        10.000000
mean      78601.400000
std       61983.471735
min       11179.000000
25%       35836.250000
50%       57369.000000
75%       96384.500000
max      213095.000000
Name: Quilometragem, dtype: float64

Para calcular a m√©dia, soma, desvio padr√£o, min, max:

In [250]:
print(f"M√©dia da quilometragem: {dados['Quilometragem'].mean()}")     # M√©dia da quilometragem
print(f"Soma total da quilometragem: {dados['Quilometragem'].sum()}") # Soma total da quilometragem
print(f"Desvio padr√£o da quilometragem: {dados['Quilometragem'].std()}") # Desvio padr√£o (dispers√£o)
print(f"Valor m√≠nimo da quilometragem: {dados['Quilometragem'].min()}") # Valor m√≠nimo da quilometragem
print(f"Valor m√°ximo da quilometragem: {dados['Quilometragem'].max()}") # Valor m√°ximo da quilometragem

M√©dia da quilometragem: 78601.4
Soma total da quilometragem: 786014
Desvio padr√£o da quilometragem: 61983.47173454119
Valor m√≠nimo da quilometragem: 11179
Valor m√°ximo da quilometragem: 213095

Para contagem usamos **.value_counts()**:

In [251]:
dados["Fabricante"].value_counts()

Fabricante
Toyota    4
Honda     3
Nissan    2
BMW       1
Name: count, dtype: int64

Podemos tamb√©m criar um novo DataFrame usando **.to_frame():**

In [252]:
dados_fabricante = dados["Fabricante"].value_counts().to_frame().reset_index()
print(dados_fabricante)

  Fabricante  count
0     Toyota      4
1      Honda      3
2     Nissan      2
3        BMW      1